#include "sparse_matrix.hpp"
#include <iostream>

int main() {
    
    SparseMatrix m1(5, 5); // матрица 5 на 5
    m1[3][1] = 42; // установить значение 42 для элемента в строке 3, столбце 1
    std::cout << m1[3][1] << std::endl; // вывод значения элемента из 3й строки, 1 столбца
    *(*(m1 + 4) + 2) = 42; // установить значение 42 для элемента в строке 3, столбце 1
    std::cout << m1[4][2] << std::endl; // вывод значения элемента из 4й строки, 2 столбца
    SparseMatrix m2 = m1; // сохранение копии m1
    SparseMatrix sum = m1 + m2; // вычислить сумму двух матриц 5x5.
    bool bb = (m1 == m2); // сравнить две матрицы на поэлементное совпадение
    std::cout << bb << std::endl;
    m1[0][0] += 2;
    m1[0][1] = 1;
    m1[1][0] = 4;
    m1[1][1] = 5;
    m2[0][0] = 3;
    m2[0][1] = 2;
    m2[1][0] = 5;
    m2[1][1] = 3;
    SparseMatrix mult = m1 * m2; // вычислить произведение двух матриц 5x5.
    std::cout << m1 << std::endl;
    std::cout << m2 << std::endl;
    std::cout << mult << std::endl;
    std::cout << 2 + m2[1][1] - *(*m1 + 1) + 8 * m2[1][0] - 2 + m2[1][0] / **(m2 + 1) << std::endl;
}

